{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 68], "dtype": "float32", "sparse": false, "ragged": false, "name": "MYINPUT"}, "name": "MYINPUT", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "Feature_normalization", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAAAwAAAAIAAABDAAAAcwwAAAB8AHwBGAB8AhsAUwApAU6pACkD2gN2YWzaBXNoaWZ0\n2gVzY2FsZXIBAAAAcgEAAAD6Qy9ob21lL250b25vbi9Qb3N0ZG9jL1RvcEVGVC9BbmFseXNpcy9O\nZXVyYWxOZXR3b3Jrcy9VdGlscy9IZWxwZXIucHnaCW5vcm1hbGl6ZVUAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "Utils.Helper", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"shift": [64.89599609375, 1.2944902181625366, 0.1379845142364502, 412.7511901855469, 184.6726837158203, 2.701979875564575, 2.130202054977417, 0.9652421474456787, 3.1743481159210205, 3.2508223056793213, 0.3273468017578125, 2.6768200397491455, 6.0, 2.0, 82.72486114501953, -0.06420636177062988, 112.60569763183594, 0.02670426294207573, 4.150078773498535, 128.0935821533203, 2.7210254669189453, 444.7541809082031, 1.9688384532928467, 2.0651187896728516, 3.455824613571167, 2.6168603897094727, 386.7202453613281, -0.0008324654190801084, 2.9081549644470215, 1.2782995700836182, 3.0437527894973755, 223.11083984375, 175.80813598632812, 247.02076721191406, 2.701979875564575, -1.0, 0.033862385898828506, 1.020380973815918, 3.6848902702331543, 49.846832275390625, 87.01580810546875, 53.05961608886719, 32.12325668334961, -0.04243699833750725, 0.003909720573574305, -0.00840788334608078, 0.0016116721089929342, 0.028646038845181465, -0.011932367458939552, 109.09876251220703, 62.61533546447754, 33.98815155029297, -9.0, 0.04436282068490982, -0.008141541853547096, -1.1566359996795654, -9.0, 0.0014051356120035052, -0.042046044021844864, -1.3698302507400513, -9.0, 0.164087176322937, 0.38691166043281555, 0.023579038679599762, -9.0, 0.05863399803638458, -0.5684508681297302, 0.2999999999999998], "scale": [83.34384155273438, 3.2628570795059204, 2.7532172203063965, 623.0375061035156, 361.10960388183594, 1.8705019354820251, 2.084169626235962, 0.429446280002594, 2.307783365249634, 2.4214694499969482, 2.134595274925232, 1.5745313167572021, 6.0, 2.0, 275.70198822021484, 2.749795913696289, 273.0372772216797, 2.883050251752138, 3.080970287322998, 278.0552520751953, 2.245504856109619, 1631.4990844726449, 1.5498046875, 1.7126100063323975, 2.884983777999878, 1.9610403776168823, 654.5682067871094, 1.3971590073197149, 2.2096543312072754, 1.4868919849395752, 1.3476961851119995, 464.13152618408105, 298.2196350097656, 377.7361297607422, 1.8705019354820251, 2.0, 9.033862385898829, 1.8840038776397705, 2.2240147590637207, 124.42144775390625, 201.89613571166797, 94.40249443054083, 53.20341110229492, 2.0413682870566845, 2.0308319465257227, 2.052087016403675, 2.9901873690541834, 2.9923470485955477, 2.9982747975736856, 250.93474578857422, 126.29779624938965, 74.43417358398438, 78.19635009765625, 3.556525267660618, 3.7637500520795584, 7.843364000320435, 12.234718084335327, 2.983994857291691, 3.0174829699099064, 7.630169749259949, 11.689877033233643, 2.164087176322937, 2.3869116604328156, 9.0235790386796, 9.988536715507507, 1.0031823068857193, 1.3771064281463623, 3.3]}}, "name": "Feature_normalization", "inbound_nodes": [[["MYINPUT", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Feature_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "MYOUTPUT", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "MYOUTPUT", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}], "input_layers": [["MYINPUT", 0, 0]], "output_layers": [["MYOUTPUT", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}