{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 68], "dtype": "float32", "sparse": false, "ragged": false, "name": "MYINPUT"}, "name": "MYINPUT", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "Feature_normalization", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAAAwAAAAIAAABDAAAAcwwAAAB8AHwBGAB8AhsAUwApAU6pACkD2gN2YWzaBXNoaWZ0\n2gVzY2FsZXIBAAAAcgEAAAD6Qy9ob21lL250b25vbi9Qb3N0ZG9jL1RvcEVGVC9BbmFseXNpcy9O\nZXVyYWxOZXR3b3Jrcy9VdGlscy9IZWxwZXIucHnaCW5vcm1hbGl6ZVUAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "Utils.Helper", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"shift": [64.77552032470703, 1.290659785270691, 0.14288759231567383, 412.43896484375, 184.801025390625, 2.696582078933716, 2.1095240116119385, 0.9656127691268921, 3.1599485874176025, 3.238988161087036, 0.33251652121543884, 2.677914619445801, 6.0, 2.0, 82.27335357666016, -0.0680893212556839, 112.35814666748047, 0.03284280374646187, 4.145627975463867, 128.54159545898438, 2.7231078147888184, 442.64373779296875, 1.9676823616027832, 2.074162244796753, 3.449622631072998, 2.615779399871826, 386.9375305175781, 0.004424168495461345, 2.9103894233703613, 1.2808059453964233, 3.04394793510437, 223.48779296875, 175.61703491210938, 246.23602294921875, 2.696582078933716, -1.0, 0.03403594717383385, 1.024605393409729, 3.6728827953338623, 50.058921813964844, 86.56098175048828, 52.987932205200195, 32.13783264160156, -0.04015897959470749, 0.003272628877311945, -0.00840788334608078, -0.002405578503385186, 0.020556974224746227, -0.023568419739603996, 109.33118438720703, 62.763790130615234, 34.138214111328125, -9.0, 0.03609171882271767, -0.013155540451407433, -1.1248372793197632, -9.0, -0.011314303614199162, -0.04042896442115307, -1.375154733657837, -9.0, 0.16913247108459473, 0.38097456097602844, 0.023579038679599762, -9.0, 0.06468656659126282, -0.5685259699821472, -0.518700458096224], "scale": [84.70673370361328, 3.2678366899490356, 2.7321105003356934, 621.1781005859375, 359.5162353515625, 1.863223910331726, 2.1048476696014404, 0.429269015789032, 2.2861697673797607, 2.4365934252738928, 2.15557000041008, 1.5814580917358398, 6.0, 2.0, 269.6308822631836, 2.7901321202516556, 270.9249954223633, 2.88436334207654, 3.0864057540893555, 275.95037841796875, 2.2519242763519287, 1620.2568969726562, 1.5509607791900635, 1.691084623336792, 2.8704113960266113, 1.9679521322250362, 642.6977233886719, 1.4113395947497338, 2.214407444000244, 1.4875844717025757, 1.3544690608978271, 463.59130859375, 292.61920166015625, 367.30322265625, 1.863223910331726, 2.0, 9.034035947173834, 1.8822273015975952, 2.2371203899383545, 124.52405548095703, 197.11748886108165, 93.99392509460449, 52.5963134765625, 2.0353979989886284, 2.0346911908127367, 2.05768471211195, 2.9863215142395347, 2.9870510576292872, 3.0093953888863325, 250.70232391357422, 125.59619522094727, 73.9701156616211, 78.19702796936019, 3.5708185769617558, 3.743432680144906, 7.875162720680237, 12.234718084335327, 2.98722902033478, 3.00793251208961, 7.624845266342163, 11.695112943649292, 2.1691324710845947, 2.3809745609760284, 9.0235790386796, 9.986907601356506, 1.0092348754405975, 1.3781238794326782, 3.518700458096224]}}, "name": "Feature_normalization", "inbound_nodes": [[["MYINPUT", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Feature_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "linear", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "linear", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "likelihood_ratio", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcwoAAAB0AKABfAChAVMAKQFOKQLaAUvaA2V4cCkB2gF2qQBy\nBAAAAPpCL2hvbWUvbnRvbm9uL1Bvc3Rkb2MvVG9wRUZUL0FuYWx5c2lzL05ldXJhbE5ldHdvcmtz\nL1V0aWxzL01vZGVsLnB52gg8bGFtYmRhPn4AAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "Utils.Model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "likelihood_ratio", "inbound_nodes": [[["linear", 0, 0, {}]]]}], "input_layers": [["MYINPUT", 0, 0]], "output_layers": [["likelihood_ratio", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}