{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 72], "dtype": "float32", "sparse": false, "ragged": false, "name": "MYINPUT"}, "name": "MYINPUT", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "Feature_normalization", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAAAwAAAAIAAABDAAAAcwwAAAB8AHwBGAB8AhsAUwApAU6pACkD2gN2YWzaBXNoaWZ0\n2gVzY2FsZXIBAAAAcgEAAAD6Qy9ob21lL250b25vbi9Qb3N0ZG9jL1RvcEVGVC9BbmFseXNpcy9O\nZXVyYWxOZXR3b3Jrcy9VdGlscy9IZWxwZXIucHnaCW5vcm1hbGl6ZVUAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "Utils.Helper", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"shift": [64.66375732421875, 1.2323075532913208, 0.11921679973602295, 436.82794189453125, 194.4150848388672, 2.6862380504608154, 2.0669236183166504, 0.9640189409255981, 3.1226084232330322, 3.200134038925171, 0.3509286046028137, 2.682894706726074, 6.0, 2.0, 93.33695220947266, -0.055151574313640594, 121.27689361572266, 0.023040134459733963, 4.1485114097595215, 135.860595703125, 2.7264792919158936, 462.1161193847656, 1.906793475151062, 1.9957109689712524, 3.3764373064041138, 2.639617085456848, 405.17547607421875, -0.001430333941243589, 2.921696424484253, 1.2550536394119263, 3.043445348739624, 234.4145050048828, 185.1238250732422, 258.572509765625, 2.6862380504608154, -1.0, 0.03686133399605751, 0.9716833829879761, 3.6702680587768555, 52.2980842590332, 93.09048461914062, 55.84196090698242, 33.41670608520508, -0.04269620031118393, 0.012058841064572334, -0.004383022198453546, -0.010126405395567417, 0.02071899175643921, 0.008885101415216923, 114.92536163330078, 64.66983795166016, 35.10329055786133, -9.0, 0.016314785927534103, -0.010207789950072765, -1.0442869663238525, -9.0, 0.015525176655501127, -0.042139727622270584, -1.3123631477355957, -9.0, 0.19360162317752838, 0.3375779092311859, 0.02545844577252865, -9.0, 0.05863399803638458, -0.5325633883476257, 0.11474744111008661, 0.1665117069585671, -0.06930308709154964, 0.5948940483274834, 0.25141076120461703], "scale": [88.23214721679688, 3.282643675804138, 2.712403416633606, 909.5849639892565, 506.7416458129869, 1.8528798818588257, 2.1423277854919434, 0.42746925354003906, 2.3031599521636963, 2.440513849258423, 2.1333440393209435, 1.632217288017273, 6.0, 2.0, 452.52468261718695, 2.677164189517498, 382.0089859008781, 2.8456436805427074, 3.0868258476257324, 355.02947311401346, 2.2427328944206235, 1642.4053649902253, 1.602420449256897, 1.7592276334762573, 2.8614495992660522, 1.9655112028121948, 915.3151245117188, 1.3922109620878464, 2.14255952835083, 1.4901872873306274, 1.3235032320022286, 574.2406463623047, 525.1198776245112, 657.334228515625, 1.8528798818588257, 2.0, 9.036861333996058, 1.8761430978775024, 2.226290225982666, 163.4283103942871, 319.96392822265506, 162.22775650024414, 84.06565475463867, 2.01242645829916, 2.032199488952756, 2.050055091967806, 2.997475200332701, 2.9848636984825134, 2.999157146550715, 322.8230590820296, 152.42130279541016, 86.93763771057083, 84.3572769165039, 3.497348826378584, 3.756792408414185, 7.9557130336761475, 12.264986515045166, 3.0032678390853107, 3.0191817052662304, 7.687636852264404, 11.715047836303711, 2.1936016231775284, 2.337577909231186, 9.025458445772529, 9.989350497722626, 1.00474514067173, 1.3375773847103094, 3.076544419532354, 3.056195752763184, 3.0276895754214177, 3.3813208371139187, 3.010163271105846]}}, "name": "Feature_normalization", "inbound_nodes": [[["MYINPUT", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Feature_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "MYOUTPUT", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "MYOUTPUT", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}], "input_layers": [["MYINPUT", 0, 0]], "output_layers": [["MYOUTPUT", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}