{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 72], "dtype": "float32", "sparse": false, "ragged": false, "name": "MYINPUT"}, "name": "MYINPUT", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "Feature_normalization", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAAAwAAAAIAAABDAAAAcwwAAAB8AHwBGAB8AhsAUwApAU6pACkD2gN2YWzaBXNoaWZ0\n2gVzY2FsZXIBAAAAcgEAAAD6Qy9ob21lL250b25vbi9Qb3N0ZG9jL1RvcEVGVC9BbmFseXNpcy9O\nZXVyYWxOZXR3b3Jrcy9VdGlscy9IZWxwZXIucHnaCW5vcm1hbGl6ZVUAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "Utils.Helper", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"shift": [64.57339477539062, 1.220686674118042, 0.11234337091445923, 441.4313201904297, 195.52438354492188, 2.6874332427978516, 2.0727338790893555, 0.9633823931217194, 3.1177008152008057, 3.2063512802124023, 0.35269930958747864, 2.681819200515747, 6.0, 2.0, 95.09857177734375, -0.06369085609912872, 123.13021087646484, 0.022508881986141205, 4.142794609069824, 136.63074493408203, 2.7277965545654297, 464.7929992675781, 1.8929492235183716, 1.9767301082611084, 3.371083974838257, 2.6501243114471436, 409.35986328125, 0.002818591892719269, 2.9233908653259277, 1.2432106733322144, 3.043445348739624, 236.49440002441406, 186.48638916015625, 260.1595458984375, 2.6874332427978516, -1.0, 0.037528518587350845, 0.957037627696991, 3.666764736175537, 52.32666015625, 94.11821746826172, 56.2516975402832, 33.56780242919922, -0.04920194111764431, 0.010676185600459576, 0.008289115969091654, -0.0064616629388183355, 0.03118116781115532, -0.005713908234611154, 115.73781967163086, 65.02796936035156, 35.2471923828125, -9.0, 0.03399557247757912, -0.008072677534073591, -1.0380499362945557, -9.0, 0.002258783672004938, -0.053699761629104614, -1.2690235376358032, -9.0, 0.2019592672586441, 0.32809507846832275, 0.025457212701439857, -9.0, 0.07061762362718582, -0.528727650642395, -0.2383563772228383, -0.3328668503646828, -0.04656771152677486, -0.23363572473094507, -0.21723165317466275], "scale": [86.87164306640625, 3.2770049571990967, 2.7254194617271423, 945.8783721923828, 515.7868957519531, 1.8639090061187744, 2.1279149055480957, 0.4264252483844757, 2.308067560195923, 2.4340667724609375, 2.1308615505695343, 1.6330057382583618, 6.0, 2.0, 475.1563720703125, 2.6714725881814907, 390.7619400024414, 2.8178592547774306, 3.1070351600646973, 367.66268157958984, 2.257547378540039, 1685.9063171386642, 1.6209524869918823, 1.7754482626914938, 2.855950224399553, 1.966404914855957, 924.3282348632749, 1.4097340181469917, 2.1381309032440186, 1.4987066984176636, 1.321319818496704, 584.1363372802734, 548.0292175292968, 676.48828125, 1.8639090061187744, 2.0, 9.03752851858735, 1.8741632103919983, 2.2260640144348134, 169.50973396301148, 333.0573196411133, 170.73997116088867, 87.43490581512438, 2.0189321991056204, 2.023447315208614, 2.055796878878027, 2.9787232449743897, 3.0043092481791973, 2.9920563383493572, 329.78638076782227, 154.1182098388672, 86.97999572753906, 84.3572769165039, 3.5011286176741123, 3.758927520830184, 7.961950063705444, 12.264986515045166, 2.9910185397602618, 3.029418498277664, 7.730976462364197, 11.697895050048828, 2.201959267258644, 2.3280950784683228, 9.02545721270144, 9.989329925179481, 1.0163482502102852, 1.3337314128875732, 3.1981491434632217, 3.151928508179952, 2.9284915113088914, 3.2297467274611904, 3.185814093371201]}}, "name": "Feature_normalization", "inbound_nodes": [[["MYINPUT", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Feature_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "MYOUTPUT", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "MYOUTPUT", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}], "input_layers": [["MYINPUT", 0, 0]], "output_layers": [["MYOUTPUT", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}