{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 43], "dtype": "float32", "sparse": false, "ragged": false, "name": "MYINPUT"}, "name": "MYINPUT", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "Feature_normalization", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAAAwAAAAIAAABDAAAAcwwAAAB8AHwBGAB8AhsAUwApAU6pACkD2gN2YWzaBXNoaWZ0\n2gVzY2FsZXIBAAAAcgEAAAD6Qy9ob21lL250b25vbi9Qb3N0ZG9jL1RvcEVGVC9BbmFseXNpcy9O\nZXVyYWxOZXR3b3Jrcy9VdGlscy9IZWxwZXIucHnaCW5vcm1hbGl6ZVUAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "Utils.Helper", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"shift": [64.44330215454102, 1.2996162176132202, 0.16365240514278412, 403.51898193359375, 173.0816650390625, 2.7138166427612305, 2.1604254245758057, 0.9652822911739349, 3.149325370788574, 3.1845033168792725, 0.3091220110654831, 2.678635835647583, 4.146346569061279, 130.40614318847656, 2.7013862133026123, 437.8984375, 1.8769589066505432, 2.141742706298828, 3.4305648803710938, 2.6144691705703735, 395.37388610839844, -0.014087836258113384, 2.9498451948165894, 1.2176909446716309, 3.0408005714416504, -1.0, 0.032314734533429146, 3.0, 1.0, 1.100641667842865, 3.6489737033843994, 40.87864303588867, 0.12902627885341644, -0.015570053365081549, 84.92732238769531, 0.010534917004406452, -0.012192687019705772, 90.87368774414062, 112.24570846557617, -0.0700056180357933, 0.0816359631717205, 170.26969146728516, 0.2869633167072383], "scale": [73.29337692260742, 3.208163857460022, 2.6562676578760147, 609.1769271850549, 336.5173645019531, 1.8344808980822556, 2.0795586109161377, 0.4279368221759796, 2.303403377532959, 2.4244186878204346, 2.167539283633232, 1.6326139330863936, 3.0341930389404297, 263.70668029785156, 2.322425994277, 1550.879150390625, 1.667667150497436, 1.642588943243025, 2.8059364199638326, 1.9809495821595187, 663.5835113525391, 1.4226875705644488, 2.162530033290386, 1.5025312900543213, 1.293567180633545, 2.0, 9.03231473453343, 3.0, 1.0, 1.8457799553871155, 2.200113534927368, 112.27894439697226, 1.0734362453222275, 0.9110823943279682, 305.55677795410156, 2.706899993307888, 2.995784827694296, 10.084801101684562, 294.0535499572746, 2.9602157697081566, 3.065833174437284, 201.0595932006836, 5.286963316707238]}}, "name": "Feature_normalization", "inbound_nodes": [[["MYINPUT", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Feature_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "linear", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "linear", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "likelihood_ratio", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcwoAAAB0AKABfAChAVMAKQFOKQLaAUvaA2V4cCkB2gF2qQBy\nBAAAAPpCL2hvbWUvbnRvbm9uL1Bvc3Rkb2MvVG9wRUZUL0FuYWx5c2lzL05ldXJhbE5ldHdvcmtz\nL1V0aWxzL01vZGVsLnB52gg8bGFtYmRhPn4AAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "Utils.Model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "likelihood_ratio", "inbound_nodes": [[["linear", 0, 0, {}]]]}], "input_layers": [["MYINPUT", 0, 0]], "output_layers": [["likelihood_ratio", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}