{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 36], "dtype": "float32", "sparse": false, "ragged": false, "name": "MYINPUT"}, "name": "MYINPUT", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "normalization", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAAAwAAAAIAAABDAAAAcwwAAAB8AHwBGAB8AhsAUwApAU6pACkD2gN2YWzaBXNoaWZ0\n2gVzY2FsZXIBAAAAcgEAAAD6Qy9ob21lL250b25vbi9Qb3N0ZG9jL1RvcEVGVC9BbmFseXNpcy9O\nZXVyYWxOZXR3b3Jrcy9VdGlscy9IZWxwZXIucHnaCW5vcm1hbGl6ZVUAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "Utils.Helper", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"shift": [64.77117919921875, 4.119966983795166, 1.0510059595108032, 0.10502934455871582, 486.6583251953125, 207.8107147216797, 2.6408179998397827, 1.8441055417060852, 0.9721455574035645, 2.9860336780548096, 3.0782723426818848, 0.3547770082950592, 493.2295379638672, 2.7455592155456543, 2.7000043392181396, -0.5145923793315887, 110.21443176269531, 0.00208773446502164, 145.11300659179688, 0.029569052159786224, 103.79422760009766, 59.89816093444824, 34.2218132019043, -0.018921788781881332, 0.03260580077767372, 0.013332001864910126, 0.032210322096943855, 0.016681166365742683, -0.04002675414085388, 128.22997283935547, -0.04435589164495468, -0.03493592143058777, 70.15714263916016, 0.03886452317237854, -0.05810699611902237, 1.2347833470941705], "scale": [101.3148193359375, 3.268062114715576, 3.258001387119293, 2.589540958404541, 1167.473559570312, 628.3893539428701, 1.8606091737747192, 2.3793999552726746, 0.42826932668685913, 2.3877880573272705, 2.3649924755096423, 2.1775982677936554, 1795.5439178466772, 2.3494645558297633, 1.6934296220540999, 1.3235366344451902, 566.0041030883787, 2.5522853000205923, 494.1388778686521, 2.76834605783224, 382.8278633117675, 221.46192741394037, 113.72085189819336, 2.0089355148375034, 2.012090001255274, 2.0749193355441093, 3.000268794968723, 2.9879375893622635, 3.010858863592148, 457.8214401245116, 3.4229538664221764, 3.0276720166206355, 207.73937606811518, 3.8303930580616, 3.0254846587777138, 4.2347833470941705]}}, "name": "normalization", "inbound_nodes": [[["MYINPUT", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "likelihood_ratio", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "likelihood_ratio", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}], "input_layers": [["MYINPUT", 0, 0]], "output_layers": [["likelihood_ratio", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}