{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 67], "dtype": "float32", "sparse": false, "ragged": false, "name": "MYINPUT"}, "name": "MYINPUT", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "Feature_normalization", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAAAwAAAAIAAABDAAAAcwwAAAB8AHwBGAB8AhsAUwApAU6pACkD2gN2YWzaBXNoaWZ0\n2gVzY2FsZXIBAAAAcgEAAAD6Qy9ob21lL250b25vbi9Qb3N0ZG9jL1RvcEVGVC9BbmFseXNpcy9O\nZXVyYWxOZXR3b3Jrcy9VdGlscy9IZWxwZXIucHnaCW5vcm1hbGl6ZVUAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "Utils.Helper", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"shift": [64.83228302001953, 0.9593368172645569, 0.07183670997619629, 584.4508056640625, 229.06851196289062, 2.5367140769958496, 1.7187944650650024, 0.9658182263374329, 2.879631519317627, 2.919473886489868, 0.361627459526062, 2.672776222229004, 8.0, 2.0, 153.1459503173828, -0.013572998344898224, 156.54002380371094, 0.01089178305119276, 3.9657845497131348, 176.5472869873047, 2.7885758876800537, 477.21514892578125, 1.7430354356765747, 1.796407699584961, 3.0244438648223877, 2.6424334049224854, 490.3747863769531, -0.0029360612388700247, 2.9064390659332275, 1.1474194526672363, 3.046696662902832, 308.36761474609375, 243.04547119140625, 332.4981689453125, 2.5367932319641113, -1.0, 0.060102518647909164, 0.8236433863639832, 3.4925215244293213, 58.643890380859375, 128.4506072998047, 69.7252197265625, 37.67631149291992, -0.013523138128221035, 0.005963705014437437, 0.002613629447296262, 0.0016116721089929342, -0.023271989077329636, 0.0015174151631072164, 143.4124298095703, 78.57870483398438, 43.83046340942383, 25.118139266967773, 0.006511068902909756, -0.019090590998530388, -0.569823682308197, -4.262997627258301, 0.01902765966951847, -0.006682557053864002, -0.8026480078697205, -3.0999948978424072, 0.286920964717865, 0.250245064496994, 0.04011695459485054, -2.0, 0.03432426601648331, -0.4465060532093048], "scale": [107.89455947875948, 3.0632615923881517, 2.4253835678100586, 1319.4520263671875, 684.8604431152344, 1.8672845363616943, 2.345972633361816, 0.4249984174966812, 2.2680788040161133, 2.4403188228607178, 2.181599259376526, 1.8415423750877364, 6.0, 2.0, 703.2428039550771, 2.3591911986470158, 493.8826507568293, 2.645513439364729, 3.184284949302649, 530.8126373291016, 2.220752000808716, 1695.7982666015578, 1.8430413007736206, 1.9238784313201904, 2.7331503868103013, 1.9707305431365967, 1210.9262390136719, 1.401884981011971, 2.077201187610626, 1.5278754234313965, 1.2312426567077637, 804.3827514648438, 779.2627563476562, 981.969183349609, 1.868187665939324, 2.0, 9.06010251864791, 1.806682252883908, 2.244771885871886, 221.72933959960938, 467.104064941401, 265.8786926269531, 125.52298507690415, 1.949997222982347, 1.977959058713168, 2.0330134645570066, 2.9918132526334364, 3.004001497477293, 2.984704136964865, 481.6645111083983, 227.0504852294901, 121.53837203979492, 73.99272346496582, 3.2670735007151954, 3.5533208232373, 8.430176317691803, 7.484492135047899, 3.0082320664077997, 2.992325765080748, 8.19735199213028, 5.9274122714996285, 2.286920964717865, 2.250245064496994, 9.04011695459485, 7.0, 0.9825083032250405, 1.2429911375045761]}}, "name": "Feature_normalization", "inbound_nodes": [[["MYINPUT", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Feature_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "MYOUTPUT", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "MYOUTPUT", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}], "input_layers": [["MYINPUT", 0, 0]], "output_layers": [["MYOUTPUT", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}