{"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "ragged": false, "name": "MYINPUT"}, "name": "MYINPUT", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "Feature_normalization", "trainable": true, "dtype": "float64", "function": ["4wMAAAAAAAAAAwAAAAIAAABDAAAAcwwAAAB8AHwBGAB8AhsAUwApAU6pACkD2gN2YWzaBXNoaWZ0\n2gVzY2FsZXIBAAAAcgEAAAD6Qy9ob21lL250b25vbi9Qb3N0ZG9jL1RvcEVGVC9BbmFseXNpcy9O\nZXVyYWxOZXR3b3Jrcy9VdGlscy9IZWxwZXIucHnaCW5vcm1hbGl6ZWAAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "Utils.Helper", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"shift": [87.41650390625, 0.0008503255667164922, 1.697125792503357, 2.0816714763641357, 2.9434423446655273, 0.009433611296117306, 111.13136291503906, 1.6723917722702026, 1.0934456586837769, 65.4674301147461, 0.5555555555555554], "scale": [363.50390625, 2.696264523523862, 1.5711008310317993, 1.5520574092865012, 2.1483463287353537, 2.93550657425076, 327.32990417480494, 3.4704670190811253, 1.8756836652755737, 84.1661605834961, 5.555555555555555]}}, "name": "Feature_normalization", "inbound_nodes": [[["MYINPUT", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Feature_normalization", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "MYOUTPUT", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "MYOUTPUT", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}], "input_layers": [["MYINPUT", 0, 0]], "output_layers": [["MYOUTPUT", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}