{"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 27], "dtype": "float32", "sparse": false, "ragged": false, "name": "MYINPUT"}, "name": "MYINPUT", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "Feature_normalization", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAAAwAAAAIAAABDAAAAcwwAAAB8AHwBGAB8AhsAUwApAU6pACkD2gN2YWzaBXNoaWZ0\n2gVzY2FsZXIBAAAAcgEAAAD6Qy9ob21lL250b25vbi9Qb3N0ZG9jL1RvcEVGVC9BbmFseXNpcy9O\nZXVyYWxOZXR3b3Jrcy9VdGlscy9IZWxwZXIucHnaCW5vcm1hbGl6ZVkAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "Utils.Helper", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"shift": [100.29367065429688, 0.005477608181536198, 87.781005859375, 2.2235571146011353, 3.391530752182007, -0.019266363233327866, 92.6113052368164, 51.42366981506348, 30.18291664123535, 0.0049096872098743916, -0.003571018227376044, 0.007343586068600416, 0.005909874569624662, -0.0003104186325799674, -0.02833576872944832, 112.4097900390625, 63.02120399475098, 35.15711975097656, 0.02513858675956726, 0.0006618324259761721, -1.0799916982650757, -0.010391726158559322, -0.002442442113533616, -1.2103561758995056, -9.0, -9.0, -9.0], "scale": [454.1270306396468, 3.3866888448968524, 466.97709259033013, 2.4186705350875854, 2.868457317352295, 0.9839274249970913, 391.89070892333984, 169.85048179626426, 111.76592063903809, 2.330389180351048, 2.3395241596782568, 2.3411965828947725, 3.1151526285521687, 3.1109468913346063, 3.1372238357365125, 518.8264044189435, 276.0748278045645, 151.1540985107422, 4.181051846742616, 4.4340049156208945, 7.920008301734924, 3.1204390665516257, 3.113263927632943, 7.789643824100494, 123.0852864837643, 13.277235159873957, 12.055552409887312]}}, "name": "Feature_normalization", "inbound_nodes": [[["MYINPUT", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 20, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Feature_normalization", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 20, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 20, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 20, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "MYOUTPUT", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "MYOUTPUT", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "input_layers": [["MYINPUT", 0, 0]], "output_layers": [["MYOUTPUT", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}