{"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "ragged": false, "name": "MYINPUT"}, "name": "MYINPUT", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "Feature_normalization", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAAAwAAAAIAAABDAAAAcwwAAAB8AHwBGAB8AhsAUwApAU6pACkD2gN2YWzaBXNoaWZ0\n2gVzY2FsZXIBAAAAcgEAAAD6Qy9ob21lL250b25vbi9Qb3N0ZG9jL1RvcEVGVC9BbmFseXNpcy9O\nZXVyYWxOZXR3b3Jrcy9VdGlscy9IZWxwZXIucHnaCW5vcm1hbGl6ZV8AAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "Utils.Helper", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"shift": [141.8629150390625, -0.006153469439595938, 3.290675640106201, 2.1206886768341064, -0.006595558021217585], "scale": [606.9241943359375, 2.387275820132345, 2.392547607421875, 2.181344747543335, 0.8870009244419634]}}, "name": "Feature_normalization", "inbound_nodes": [[["MYINPUT", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Feature_normalization", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "MYOUTPUT", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "MYOUTPUT", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["MYINPUT", 0, 0]], "output_layers": [["MYOUTPUT", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}